Revit 2027 API
BuiltInFailures.WorksharingFailures.MissingUpdaterLatestOrCentralSingular Property
 The file [File Name] you are trying to synchronize was modified by the third-party updater [Updater Name(s)] which is not currently installed. \n\r \n\r If you continue to Synchronize with Central or Reload Latest, data maintained by this updater will not be updated properly. This may create problems when [File Name] is later opened when [Updater Name(s)] is present.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MissingUpdaterLatestOrCentralSingular { get; }
Public Shared ReadOnly Property MissingUpdaterLatestOrCentralSingular As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MissingUpdaterLatestOrCentralSingular {
	FailureDefinitionId^ get ();
}
static member MissingUpdaterLatestOrCentralSingular : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WorksharingFailures Class
Autodesk.Revit.DB Namespace